/******************************************************************************

                            Online C Compiler.
                Code, Compile, Run and Debug C program online.
Write your code in this editor and press "Run" button to compile and execute it.

*******************************************************************************/

#include <stdio.h>
#include <math.h>

int main()
{
    printf("Hello World\n");
    printf("Aufwiedersehen Leute...alles Gut ware!\n");
    printf("Do Skorogo Bratushki nye poklav je proznam\n");
    printf("Σήμερα είναι Τετάρτη\n");
    printf("Я Люблю тебе Болшоивом Советский Союз\n");
    
    int x,y,j,k,p,a,s,d;
    float f,x1,y1,j1,k1; /*  δηλωση παραμετρων  */
       x1=10.0;
       y1=15.0;
       j1=25.0;
       k1=30.0;
       float p_dier;
       x=10; /*  ορισμος του Χ  */
       y=15; /*  ορισμος του Υ  */
       p_dier=(x/y);
          p=(x*y);  /*  1η κλήση συνάρτησης (πολλαπλασιασμος Χ,Y)  */
          printf("%d\n",p); /*  εμφάνιση του αποτελέσματος ως ακέραιος αριθμός */
          a=(x+y); /*  αποτελεσμα προσθεσης  */
          printf("%d\n",a); /*  1η κλήση συνάρτησης (προσθεση Χ,Υ)  */
          s=(x-y); /*  αποτελεσμα αφαιρεσης  */
          printf("%d\n",s); /*  1η κλήση συνάρτησης (αφαιρεση Χ,Y)  */
          p_dier=(x/y); /*  αποτελεσμα διαιρεσης ως ακέραιος  */
          printf("%f\n",p_dier); /*  1η κλήση συνάρτησης (διαιρεση Χ,Υ)  */
          f=pow(x,y); /*  αποτελεσμα δυναμης  */
          printf("%f\n",f); /*  1η κλήση συνάρτησης (δυναμη Χ,Y)  */
           
       j=25; /* ορισμος του J  */
       k=30; /* ορισμος του K  */
       p_dier=(j/k);
          p=(j*k);  /*  2η κλήση συνάρτησης (πολλαπλασιασμος J,K) */
          printf("%d\n",p); /*  εμφάνιση του αποτελέσματος ως ακέραιος αριθμός */
          a=(j+k); /*  αποτελεσμα προσθεσης  */
          printf("%d\n",a); /*  1η κλήση συνάρτησης (προσθεση J,K)  */
          s=(j-k); /*  αποτελεσμα αφαιρεσης  */
          printf("%d\n",s); /*  1η κλήση συνάρτησης (αφαιρεση J,K)  */
          p_dier=(j/k); /*  αποτελεσμα διαιρεσης ως ακέραιος  */
          printf("%f\n",p_dier); /*  1η κλήση συνάρτησης (διαιρεση J,K)  */
          f=pow(j,k); /*  αποτελεσμα δυναμης  */
          printf("%f\n",f); /*  1η κλήση συνάρτησης (δυναμη J,K)  */
    return 0;
}